USER_START_NO_ROLE = "Юзер, у якого немає ролі, натиснув старт"
USER_START_ADMIN = "Привіт, обирай що хочеш"

USER_NOT_REGISTERED = "Введіть команду /start"
USER_HASNT_ACCESS = "Немає доступу"

HOW_TO_ADD_CHANNEL = "Щоб додати канал до вашого списку, перешліть будьяке повідомлення з каналу мені 📩 головне щоб збереглося ім'я каналу при пересиланні"

BOT_IS_NO_ADMIN_THAT_CHANNEL = "Бот не доданий до каналу звідки надіслано це сповіщення"
CHANNEL_ALREADY_ADDED_TO_YOU = "Цей канал вже давно додано до твого профілю"
CHANNEL_JUST_ADDED = "Канал щойно було додано до твого профілю"
CHANNEL_ERROR_ADD = "Помилка при додаванні каналу, напиши адміну"

LIST_CHANNELS_EMPTY = "Список каналів пустий"
