USER_START_NO_ROLE = "Привіт, ти вже зареєстрований"
USER_HAS_REFISTER = "Вітаю, ти успішно зареєструвався!"
USER_START_ADMIN = "Привіт, обирай що хочеш"

USER_NOT_REGISTERED = "Введіть команду /start"
USER_HASNT_ACCESS = "Немає доступу"

HOW_TO_ADD_CHANNEL = "Щоб додати канал до вашого списку, перешліть будьяке повідомлення з каналу мені 📩 головне щоб збереглося ім'я каналу при пересиланні"

BOT_IS_NO_ADMIN_THAT_CHANNEL = "Бот не доданий до каналу звідки надіслано це сповіщення"
CHANNEL_ALREADY_ADDED_TO_YOU = "Цей канал вже давно додано до твого профілю"
CHANNEL_JUST_ADDED = "Канал щойно було додано до твого профілю"
CHANNEL_ERROR_ADD = "Помилка при додаванні каналу, напиши адміну"

LIST_CHANNELS_EMPTY = "Список каналів пустий"
LIST_LINKS_EMPTY = "Немає створених посилань"

SET_NAME_FOR_LINK = "Встановити ім'я для посилання (за потреби)"
LONG_NAME_FOR_LINK = "Дуже довга назва, вкладись у 32 символи"

SET_HELLO_MESSAGE_LINK = ("Якщо потрібен текст, який буде надсилатися користувачу під час прийняття заявки саме на це посилання, то можеш написати його або пропустити цей пункт\n"
                          "Ти також можеш застосовувати форматування з телеграму, воно передається в повідомлення.")
LONG_HELLO_FOR_LINK = "Дуже довге повідомлення, вкладись у 2000 символів"

LINK_PREPARE_CAMPLETED = "Посилання сформовано! Залишилося зовсім трішки"
CREATE_LINK_NOW = "Створити посилання"
PREVIEW_HELLO_MESSAGE = "Попередній перегляд привітального повідомлення"

PREVIEW_HELLO_MESSAGE_CONSTRUCT = "<b>Попередній перегляд</b>\n\n{0}"
YOU_HASNT_HELLO_MESSAGE = "У вас немає привітального тексту для цього посилання, ви пропустили цей пункт при створенні"
WITHOUT_NAME = "Без назви"

ERROR_LINK_CREATED = "Помилка при створенні посилання. \n\n"
SUCCESSFUL_LINK_CREATED = "Посилання успішно створено. \n\n"

MAX_20_LINKS = "Максимум 20 посилань на канал! Якщо хочеш додати ще, то видали інше, або напиши адміну щоб розширити доступ"
MANAGMENT_LINKS = "Ви перейшли в категорію \"менеджмент посилань\". Тут можна видаляти посилання та переглядати статистику по кожному"

ERROR_LINK_DELETED_FROM_TG = "Помилка при видалення посилання з тг (опцілнально). \n\n"
ERROR_LINK_DELETED_FROM_DATA_BASE = "Помилка при видалення посилання з бази даних. \n\n"
SUCCESSFUL_LINK_DELTED = "Посилання успішно видалено з бази даних."

DELETE_CHANNEL = "Точно видалити канал?"
DELETE_CHANNEL_CHANCEL = "Видалення каналу відмінено"
DELETE_CHANNEL_SUCCESSFUL = "Канал успішно видалено"
DELETE_CHANNEL_FAIL = "Помилка при видаленні каналу"

YES = "ТАК"
NO = "НІ"

SKIP = "Пропустити"
CANCEL_ = "Відмінити операцію"

CANCELED_SUCCESSFUL = "Операцію скасовано"
